DataProcessors/бит_сл_КлиентЛицензирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>бит_сл_КлиентЛицензирования</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервераИПорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортАссистентаСервераЛицензий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОжиданияДоАктивации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяНадпись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеАктивации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСоединения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКлиентаИСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоПовторов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьProxyСервер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияДляТехПоддержки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожетТребоватьсяИзменениеВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>общ_СписокИсключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>общ_АдресСервераИПорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>общ_ПортАссистентаСервераЛицензий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>общ_ВремяОжиданияДоАктивации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>общ_ПубликацияНастроек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>общ_ИспользоватьProxyСервер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательИБ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/бит_сл_КлиентЛицензирования/Forms/СистемаЛицензирования_упр_13/Ext/Form/Module.bsl
&НаКлиенте 
Перем ОбработчикПодключен;

///////////////////////////////////////////////////////////////
// СЕРВЕРНЫЕ МЕТОДЫ ///////////////////////////////////////////

&НаСервере
// Получает все необходимые данные для формы
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_сл_сервер.ОбновитьЗначенияРеквизитов(Объект);
	Элементы.ОбщиеНастройки.Доступность = РольДоступна("бит_сл_Администратор") ИЛИ
	                                      РольДоступна("ПолныеПрава") ИЛИ
										  РольДоступна("бит_ПолныеПрава") ИЛИ
										  ПользователиИнформационнойБазы.ТекущийПользователь().Имя = "";
	
КонецПроцедуры

&НаСервере
// Обновляет все реквизиты на форме
//
Процедура ОбновитьДанныеФормы()

	бит_сл_сервер.ОбновитьЗначенияРеквизитов(Объект);
	
	ЧислоИсключений = ?(Объект.общ_СписокИсключения="", 0, СтрЧислоСтрок(Объект.общ_СписокИсключения));
	
КонецПроцедуры // ОбновитьДанныеФормы()

&НаСервере 
// Передает структуру параметров на сервер для сохранения
//
Процедура ПередатьНастройкиНаСервер()

	бит_сл_сервер.СохранитьНастройкиВОбъект(Объект);

КонецПроцедуры // ПередатьНастройкиНаСервер() 

///////////////////////////////////////////////////////////////
// КЛИЕНТСКИЕ МЕТОДЫ //////////////////////////////////////////

&НаКлиенте
// Запускается каждые 4 секунды для обновления данных формы
//
Процедура ОбработчикОбновленияДанныхФормы()

	ОбновитьДанныеФормы();
	
	Элементы.КнопкаОбновитьСоединение.Доступность = Истина;
	
	Если Элементы.ГруппаПредупреждениеАктивностиОбщихНастроек.Видимость <> Объект.общ_ПубликацияНастроек Тогда
		Элементы.ГруппаПредупреждениеАктивностиОбщихНастроек.Видимость = Объект.общ_ПубликацияНастроек;
	КонецЕсли;

	Элементы.ДекорацияФлагПубликации.ЦветТекста = ?(Объект.общ_ПубликацияНастроек, Новый Цвет(53,115,5), Новый Цвет(153,51, 0));
	
КонецПроцедуры // ОбработчикОбновленияДанныхФормы() 

&НаКлиенте 
// Отключает обработчик ожидания при редактировании значений
//
Процедура ОтключитьОбработчикОжиданияПриРедактировании()

	Если ОбработчикПодключен Тогда
		
		ОтключитьОбработчикОжидания( "ОбработчикОбновленияДанныхФормы" );
	    ОбработчикПодключен = Ложь;
		
	КонецЕсли; 	

КонецПроцедуры // ОтключитьОбработчикОжиданияПриРедактировании() 

&НаКлиенте 
// Подключает обработчик ожидания после окончания редактирования значения
//
Процедура ПодключитьОбработчикОжиданияПослеРедактирования()

	Если Не ОбработчикПодключен Тогда
		
		ОбработчикПодключен = Истина;
		ПодключитьОбработчикОжидания( "ОбработчикОбновленияДанныхФормы", 4, Ложь );
	
	КонецЕсли;

КонецПроцедуры // ПодключитьОбработчикОжиданияПослеРедактирования()

&НаКлиенте
// Выполняет первоначальную настройку формы при открытии 
//
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДанныеФормы();	
	ОбработчикПодключен = Истина;
	ПодключитьОбработчикОжидания( "ОбработчикОбновленияДанныхФормы", 4, Ложь );
	Элементы.КнопкаОбновитьСоединение.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Подготавливает обарботку к выгрузке
//
Процедура ПриЗакрытии()
	
	ОтключитьОбработчикОжидания( "ОбработчикОбновленияДанныхФормы" );

КонецПроцедуры

&НаКлиенте
// Открывает панель настроек
//
Процедура ОткрытьЗакладкуНастроек(Команда)
	
	Элементы.ПанельЗакладок.ТекущаяСтраница = Элементы.Настройки; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояние(Команда)
	
	ОбновитьСостояниеДействие();
	
	Элементы.ПанельЗакладок.ТекущаяСтраница = Элементы.ГруппаСообщенияСистемы;	
	Элементы.КнопкаОбновитьСоединение.Доступность = Ложь;
	Объект.ОсновнаяНадпись = "Пожалуйста, подождите...";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеДействие()
	
	бит_сл_клиент.ПередОбновлениемСостояния();
	бит_сл_сервер.ОтключитьсяОтСервера();
	бит_сл_сервер.ПолучитьЛицензиюДляТекущегоПродукта();	
	бит_сл_клиент.ПриОбновленииСостояния();	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	ПередатьНастройкиНаСервер();	
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСервераИПортПриИзменении(Элемент)
	
	ПередатьНастройкиНаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяОжиданияДоАктивацииПриИзменении(Элемент)
	
	ПередатьНастройкиНаСервер();	
	
КонецПроцедуры

&НаКлиенте
Процедура общ_АдресСервераИПортПриИзменении(Элемент)
	
	ПередатьНастройкиНаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура общ_ВремяОжиданияДоАктивацииПриИзменении(Элемент)
	
	ПередатьНастройкиНаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура общ_ПубликацияНастроекПриИзменении(Элемент)
	
	ПередатьНастройкиНаСервер();
	
	Элементы.ДекорацияФлагПубликации.ЦветТекста = ?(Объект.общ_ПубликацияНастроек, Новый Цвет(53,115,5), Новый Цвет(153, 51, 0));
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСервераИПортАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ОтключитьОбработчикОжиданияПриРедактировании();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСервераИПортОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ПодключитьОбработчикОжиданияПослеРедактирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельЗакладокПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если (ТекущаяСтраница = Элементы.ОбщиеНастройки) Тогда
	
		ЧислоИсключений = ?(Объект.общ_СписокИсключения="", 0, СтрЧислоСтрок(Объект.общ_СписокИсключения));
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСписка(Команда)
	
	// Откроем форму списка пользователей
	Форма = ?(бит_сл_клиент.ИспользоватьФормы13Платформы(), 
	          ПолучитьФорму("Обработка.бит_сл_КлиентЛицензирования.Форма.СписокПользователей_упр_13",,ЭтаФорма),
	          ПолучитьФорму("Обработка.бит_сл_КлиентЛицензирования.Форма.СписокПользователей_упр",,ЭтаФорма));  
	Результат = Форма.ОткрытьМодально();
	Если (ТипЗнч(Результат) = Тип("Булево")) И (Результат = Истина) Тогда
		
		// Сохраним настройки
		ПередатьНастройкиНаСервер();
		ЧислоИсключений = ?(Объект.общ_СписокИсключения="", 0, СтрЧислоСтрок(Объект.общ_СписокИсключения));
		
	КонецЕсли;
		
КонецПроцедуры
